# INTRO TO PANDAS

## Exercises (Basic)

1. Create a Pandas Series with your five favorite numbers.

2. Create a DataFrame with columns Name, Age, and Salary for 5 people.

3. Convert a dictionary to a Pandas DataFrame and print its shape.

4. Import a CSV file into a DataFrame and display the first five rows.

5. Create a DataFrame from a list of dictionaries.

In [3]:
#Q1
import pandas as pd
import numpy as np
df = pd.Series([1,2,3,4,5])
df

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
#Q2
dict = {
    'Name' : ["Ahmed","Saad","Ayan","Fuzail","Mughees"],
    'Salary' : [10000,3000,30000,0,0],
    'Age' : [20,19,19,20,19]
}

df2 = pd.DataFrame(dict)
print(df2)
#Q3
print(df2.shape)

      Name  Salary  Age
0    Ahmed   10000   20
1     Saad    3000   19
2     Ayan   30000   19
3   Fuzail       0   20
4  Mughees       0   19
(5, 3)

In [5]:
#Q4
df3 = pd.read_excel('SaleData.xlsx')
df3.head()

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
0,2018-01-06,East,Martha,Alexander,Television,95.0,1198.0,113810.0
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50.0,500.0,25000.0
2,2018-02-09,Central,Hermann,Luis,Television,36.0,1198.0,43128.0
3,2018-02-26,Central,Timothy,David,Cell Phone,27.0,225.0,6075.0
4,2018-03-15,West,Timothy,Stephen,Television,56.0,1198.0,67088.0

In [6]:
import pandas as pd

# Proper list of dictionaries (each dictionary representing one row)
data = [
    {'Name': 'Ahmed', 'Salary': 10000, 'Age': 20},
    {'Name': 'Saad', 'Salary': 3000, 'Age': 19},
    {'Name': 'Ayan', 'Salary': 30000, 'Age': 19},
    {'Name': 'Fuzail', 'Salary': 0, 'Age': 20},
    {'Name': 'Mughees', 'Salary': 0, 'Age': 19}
]

# Creating DataFrame
df3 = pd.DataFrame(data)

# Display DataFrame
print(df3)

      Name  Salary  Age
0    Ahmed   10000   20
1     Saad    3000   19
2     Ayan   30000   19
3   Fuzail       0   20
4  Mughees       0   19

1. Create a Series with country names as indices and their capitals as values.
2. Convert a NumPy array into a DataFrame.
3. Retrieve a specific column from a DataFrame.
4. Retrieve the first three rows of a DataFrame.
5. Modify a specific row's values in a DataFrame.

In [7]:
#Q1
list = ["Isl","Delhi","NYC","Kabul","Toronto"]
Index = ["PAK","IND","USA","AFG","CAN"]

df = pd.Series(list, index = Index)
print(df)

PAK        Isl
IND      Delhi
USA        NYC
AFG      Kabul
CAN    Toronto
dtype: object

In [8]:
#Q2
arr = np.array([1,2,4,5,8,3,2,1])
df2 = pd.DataFrame(arr)
print(df2)

   0
0  1
1  2
2  4
3  5
4  8
5  3
6  2
7  1

In [9]:
#Q3
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35],'City': ['New York', 'Los Angeles', 'Chicago']}
df3 = pd.DataFrame(data)
print(df3.columns)

Index(['Name', 'Age', 'City'], dtype='object')

In [10]:
#Q4
print(df3.iloc[0:])

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [11]:
#Q5
import pandas as pd

# Create a sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'Los Angeles', 'Chicago']}

df = pd.DataFrame(data)

# Modify a specific row (e.g., update Bob's age and city)
df.loc[1, 'Age'] = 32  # Updating a single column
df.loc[1, 'City'] = 'San Francisco'  # Updating another column

# Alternatively, modify the entire row
df.loc[1] = ['Bob', 32, 'San Francisco']

# Display the updated DataFrame
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   32  San Francisco
2  Charlie   35        Chicago

## Exercises
1.	Detect missing values in a dataset.
2.	Replace missing values with the column mean.
3.	Drop all rows with missing values.
4.	Fill missing values with a fixed value.
5.	Interpolate missing values in time series data.

In [12]:
#Q1
df = pd.DataFrame({
    "Name" : ["Ahmed","Ali",np.nan],
    "Age" : [20,np.nan,20],
    "Salary": [1000,np.nan,2000]
})

print(df.isnull())

    Name    Age  Salary
0  False  False   False
1  False   True    True
2   True  False   False

In [13]:
#q2
df['Age'].fillna(df['Age'].mean())
df['Salary'].fillna(df['Salary'].mean())

0    1000.0
1    1500.0
2    2000.0
Name: Salary, dtype: float64

In [14]:
#q3
df
df.dropna()

    Name   Age  Salary
0  Ahmed  20.0  1000.0

In [15]:
#q4
df.fillna(10)

    Name   Age  Salary
0  Ahmed  20.0  1000.0
1    Ali  10.0    10.0
2     10  20.0  2000.0

In [16]:
#q5
import pandas as pd
import numpy as np

# Creating a sample time-series dataset with missing values
data = {
    'Date': pd.date_range(start='2025-03-01', periods=6, freq='D'),
    'Value': [10, np.nan, 20, np.nan, np.nan, 50]
}

df = pd.DataFrame(data)

# Set 'Date' as the index
df.set_index('Date', inplace=True)

# Interpolating missing values based on time
df['Value'] = df['Value'].interpolate(method='time')

print(df)

            Value
Date
2025-03-01   10.0
2025-03-02   15.0
2025-03-03   20.0
2025-03-04   30.0
2025-03-05   40.0
2025-03-06   50.0

### Exercises
1.	Select a subset of columns from a DataFrame.
2.	Filter rows based on a condition.
3.	Filter rows based on multiple conditions.
4.	Select specific rows using .loc[] and .iloc[].
5.	Retrieve only even-indexed rows from a DataFrame.

In [17]:
#   q1  
df = pd.DataFrame({
    "Name" : ["Ahmed","Ali","aqsa"],
    "Age" : [20,11,20],
    "Salary": [1000,3500,2000]
})

print(df[["Name","Age"]])

    Name  Age
0  Ahmed   20
1    Ali   11
2   aqsa   20

In [18]:
#   q2
df.loc[df["Age"]>15]

    Name  Age  Salary
0  Ahmed   20    1000
2   aqsa   20    2000

In [19]:
#   q3  
df.loc[(df["Age"] > 15) & (df["Salary"] > 1500)]

   Name  Age  Salary
2  aqsa   20    2000

In [20]:
#q5
df.iloc[df.index%2==0]

    Name  Age  Salary
0  Ahmed   20    1000
2   aqsa   20    2000

### Exercises
1.	Sort a DataFrame by a numerical column.
2.	Rename a column.
3.	Add a new column.
4.	Remove a column.
5.	Sort by multiple columns.

In [21]:
# q1
df.sort_values(by="Salary")
#q2
df.rename(columns={"Name": "FirstName"}, inplace=True)
#q3
df["City"] = ["Karachi","Isl","Karachi"]
#q4
df.drop("City", axis=1)
#q5
df.sort_values(by=["Salary", "Age"])

  FirstName  Age  Salary     City
0     Ahmed   20    1000  Karachi
2      aqsa   20    2000  Karachi
1       Ali   11    3500      Isl

Exercise 1: Group Data by a Categorical Column

Create a DataFrame sales_data with columns:

Product: Name of the product (e.g., "Laptop", "Phone").
Category: Type of product (e.g., "Electronics", "Accessories").
Revenue: Sales revenue for each product.
Then, group the data by Category.

In [26]:
sales_data=pd.DataFrame({
    'Product': ['Laptop', 'Phone', 'Headphones', 'Mouse', 'Keyboard', 'Tablet'],
    'Category': ['Electronics', 'Electronics', 'Accessories', 'Accessories', 'Accessories', 'Electronics'],
    'Revenue': [1000, 800, 200, 150, 120, 500]
})
print(sales_data)

sales_data.groupby('Category')['Revenue'].sum()

      Product     Category  Revenue
0      Laptop  Electronics     1000
1       Phone  Electronics      800
2  Headphones  Accessories      200
3       Mouse  Accessories      150
4    Keyboard  Accessories      120
5      Tablet  Electronics      500

Category
Accessories     470
Electronics    2300
Name: Revenue, dtype: int64

Exercise 2: Find the Average Value Per Group

Use the sales_data DataFrame.
Find the average revenue per product category.

In [27]:
sales_data.groupby('Category')['Revenue'].mean()

Category
Accessories    156.666667
Electronics    766.666667
Name: Revenue, dtype: float64

Exercise 3: Count the Number of Items Per Group

Use the sales_data DataFrame.
Count how many products are in each category.

In [28]:
sales_data.groupby('Category')['Revenue'].count()

Category
Accessories    3
Electronics    3
Name: Revenue, dtype: int64

Exercise 4: Find the Max Value in Each Group

Use the sales_data DataFrame.
Find the highest revenue product in each category.

In [29]:
sales_data.groupby('Category')['Revenue'].max()

Category
Accessories     200
Electronics    1000
Name: Revenue, dtype: int64

Exercise 5: Apply Multiple Aggregation Functions

Use the sales_data DataFrame.
Find the average, maximum, and count of revenue for each category using multiple aggregation functions.

In [30]:
sales_data.groupby('Category')['Revenue'].agg(['mean', 'max', 'count'])

                   mean   max  count
Category
Accessories  156.666667   200      3
Electronics  766.666667  1000      3

Exercise 1: Merge Two DataFrames

Create two DataFrames:

students: Contains ID and Name.
marks: Contains ID and Math_Score.
Then, merge them based on ID.

In [33]:
student = pd.DataFrame({
    "ID" : [1,2,3,4,5],
    "NAME" : ["Ahmed","Mohsin","Ayan","Saad","aqsa"]
})
print(student,"\n")
marks = pd.DataFrame({
    "ID" : [1,2,3,4,5],
    "Math" : [95,88,78,48,78]
})
print(marks,"\n")

pd.merge(student,marks, on="ID")

   ID    NAME
0   1   Ahmed
1   2  Mohsin
2   3    Ayan
3   4    Saad
4   5    aqsa

   ID  Math
0   1    95
1   2    88
2   3    78
3   4    48
4   5    78

   ID    NAME  Math
0   1   Ahmed    95
1   2  Mohsin    88
2   3    Ayan    78
3   4    Saad    48
4   5    aqsa    78

Exercise 2: Perform an Inner Join

Create two DataFrames:

employees: Contains Employee_ID and Employee_Name.
salaries: Contains Employee_ID and Salary but includes some missing IDs.
Perform an inner join on Employee_ID.

In [34]:
employees = pd.DataFrame({
    "ID" : [1,2,3,4,5],
    "NAME" : ["Ahmed","Mohsin","Ayan","Saad","aqsa"]
})
print(employees,"\n")
salaries = pd.DataFrame({
    "ID" : [1,2,7,9,5],
    "Salary" : [950102,88045,7897,484,7800]
})
print(salaries,"\n")

pd.merge(employees,salaries, on="ID", how="inner")

   ID    NAME
0   1   Ahmed
1   2  Mohsin
2   3    Ayan
3   4    Saad
4   5    aqsa

   ID  Salary
0   1  950102
1   2   88045
2   7    7897
3   9     484
4   5    7800

   ID    NAME  Salary
0   1   Ahmed  950102
1   2  Mohsin   88045
2   5    aqsa    7800

Exercise 3: Perform a Left Join

Use the employees and salaries DataFrames from Exercise 2.
Perform a left join, keeping all employees even if they donâ€™t have salary data.

In [35]:
pd.merge(employees,salaries, on="ID", how="left")

   ID    NAME    Salary
0   1   Ahmed  950102.0
1   2  Mohsin   88045.0
2   3    Ayan       NaN
3   4    Saad       NaN
4   5    aqsa    7800.0

Exercise 4: Concatenate Two DataFrames

Create two DataFrames:

batch_1: Contains students ID and Name.
batch_2: Contains more students with the same columns.
Concatenate them into a single DataFrame.

In [39]:
batch_1 =pd.DataFrame({
    "ID" : [1,2,3,4,5],
    "NAME" : ["Ahmed","Mohsin","Ayan","Saad","aqsa"]
})
print(student,"\n")
batch_2 = pd.DataFrame({
    "ID" : [6,7,8,9,10],
    "NAME" : ["Hassan","ALi","Minha","Zainab","Qasim"]
})
print(marks,"\n")

pd.concat([batch_1,batch_2], ignore_index=True)

   ID    NAME
0   1   Ahmed
1   2  Mohsin
2   3    Ayan
3   4    Saad
4   5    aqsa

   ID  Math
0   1    95
1   2    88
2   3    78
3   4    48
4   5    78

   ID    NAME
0   1   Ahmed
1   2  Mohsin
2   3    Ayan
3   4    Saad
4   5    aqsa
5   6  Hassan
6   7     ALi
7   8   Minha
8   9  Zainab
9  10   Qasim

Exercise 5: Join Multiple DataFrames

Create three DataFrames:

students: Contains ID and Name.
marks: Contains ID and Math_Score.
departments: Contains ID and Department.
Merge them into a final DataFrame.

In [46]:
student = pd.DataFrame({
    "ID" : [1,2,3,4,5],
    "NAME" : ["Ahmed","Mohsin","Ayan","Saad","aqsa"]
})
# print(student,"\n")
marks = pd.DataFrame({
    "ID" : [1,2,3,4,5],
    "Math" : [95,88,78,48,78]
})
# print(marks,"\n")
department = pd.DataFrame(
    {
       "ID" : [1,2,3,4,5],
       "Department" : ["CS","MBBS","CS","SE","ARTS"] 
    }
)

pd.merge(pd.merge(student, marks, on="ID"), department, on="ID")

   ID    NAME  Math Department
0   1   Ahmed    95         CS
1   2  Mohsin    88       MBBS
2   3    Ayan    78         CS
3   4    Saad    48         SE
4   5    aqsa    78       ARTS